feat: update tasks, update guide
